### Pandas 학습

1. 데이터 분석을 위한 모듈
2. excel과 가장 큰 차이점 : Pandas는 대용량 데이터 처리가 가능
3. 데이터 분석 및 데이터 가공에 절대적으로 사용되는 library
4. 주요 학습 내용
> 1. DataFrame - excel의 다수의 컬럼들을 보유한 table과 동일하다 간주
> 2. series - DataFrame을 구성하는 column 간주

In [3]:
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'1.1.3'

In [4]:
s = pd.Series([1, 2, 3])
print(s)
print(type(s))

0    1
1    2
2    3
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
print(s.values)  # series  데이터들만 list

print("-"*10)

print(s.index)   # series의 index 정보 확인 

print("-"*10)

print(s.value_counts)  #

[1 2 3]
----------
RangeIndex(start=0, stop=3, step=1)
----------
<bound method IndexOpsMixin.value_counts of 0    1
1    2
2    3
dtype: int64>

In [14]:
# python에서 nn/nan등은 결측치 의미 
s = pd.Series([3, 1, 2, 3, 4, np.nan])
print(s)
print("-"*10)
s.value_counts(normalize=True)

0    3.0
1    1.0
2    2.0
3    3.0
4    4.0
5    NaN
dtype: float64
----------

3.0    0.4
4.0    0.2
2.0    0.2
1.0    0.2
dtype: float64

In [15]:
# python에서 nn/nan등은 결측치 의미 
# 결측치를 제외한 유효한 데이값들의 개수 반환
s = pd.Series([3, 1, 2, 3, 4, np.nan])
s.value_counts()

3.0    2
4.0    1
2.0    1
1.0    1
dtype: int64

In [16]:
s = pd.Series([3, 1, 2, 3, 3, np.nan])
s.value_counts()

3.0    3
2.0    1
1.0    1
dtype: int64

In [17]:
s = pd.Series(['a', 'b', 'a', np.nan])
s.value_counts()

a    2
b    1
dtype: int64

In [18]:
# Nan에 해당하는 결측지로 유효하게 counting 
s = pd.Series(['a', 'b', 'a', np.nan])
s.value_counts(dropna=False)

a      2
b      1
NaN    1
dtype: int64

In [21]:
print(s)
print('-'*10)
print(s.count())  # 결측치 무시하고 유효 데이터 수만 counting

0      a
1      b
2      a
3    NaN
dtype: object
----------
3

In [22]:
s = pd.Series([1, 2])   # 정수 데이터 - int64
print(s)

0    1
1    2
dtype: int64

In [23]:
s = pd.Series([1.3, 2.6])   # 실수 데이터 - float64
print(s)

0    1.3
1    2.6
dtype: float64

In [25]:
s = pd.Series(['a', 'b'])   # 문자 데이터 - object
print(s)

0    a
1    b
dtype: object

In [28]:
# 정수 타입의 데이터를 실수 타입으로 설정
s = pd.Series([1, 2], dtype='float64')  
print(s)

0    1.0
1    2.0
dtype: float64

In [33]:
# 데이터 자체에서 결측치 제거
s = pd.Series(['a', 'b', np.nan])  
print(s)
print(10*'-')
print(s.dropna())  # nan값이 제거된 새로운 Series 추가 생성(복제본) 단 s 원본은 유지

print(10*'-')
print(s)  # 원본

print(10*'-')
# 원본 자체 수정
s = s.dropna()
print(s)

0      a
1      b
2    NaN
dtype: object
----------
0    a
1    b
dtype: object
----------
0      a
1      b
2    NaN
dtype: object
----------
0    a
1    b
dtype: object

특정 날짜를 기준으로 DataFrame생성해 보기

In [34]:
datas = pd.date_range('20210310', periods=5)
print(datas)

DatetimeIndex(['2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14'],
              dtype='datetime64[ns]', freq='D')

In [88]:
np.random.randint(10)

0

In [119]:
np.random.rand()

0.08909759268535133

In [134]:
# 0~1사이의 균일분포값 반환하는 난수 발생 API
# 6행 4열 구성
df = pd.DataFrame(np.random.rand(6, 4))

In [135]:
df

          0         1         2         3
0  0.446292  0.068244  0.139416  0.455768
1  0.376277  0.739580  0.602806  0.655243
2  0.408221  0.078706  0.582398  0.611342
3  0.255766  0.810953  0.610930  0.436456
4  0.866891  0.463141  0.935027  0.009209
5  0.837564  0.606112  0.691553  0.253232

In [136]:
datas = pd.date_range('20210310', periods=12)
print(datas)

DatetimeIndex(['2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21'],
              dtype='datetime64[ns]', freq='D')

In [138]:
datas[0]

Timestamp('2021-03-10 00:00:00', freq='D')

In [139]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [142]:
# 0~1까지의 균일 분포 값을 12by4 즉 48개 구성 후에 이미 존재하는 DatetimeIndex 를 index로 적용해서 가공된 DataFrame
df = pd.DataFrame(np.random.rand(12, 4), index=datas)
df

                   0         1         2         3
2021-03-10  0.516188  0.750403  0.990132  0.077257
2021-03-11  0.383775  0.891690  0.100132  0.442210
2021-03-12  0.597430  0.571634  0.674968  0.114928
2021-03-13  0.999053  0.165311  0.204110  0.579335
2021-03-14  0.892155  0.280247  0.164164  0.851375
2021-03-15  0.628471  0.188612  0.163502  0.134532
2021-03-16  0.670535  0.581497  0.102605  0.629424
2021-03-17  0.463981  0.197294  0.875919  0.298184
2021-03-18  0.716765  0.601376  0.495101  0.905353
2021-03-19  0.190593  0.451922  0.480395  0.148842
2021-03-20  0.075446  0.670160  0.093799  0.217923
2021-03-21  0.770354  0.455774  0.019376  0.214375

In [143]:
type(df)

pandas.core.frame.DataFrame

In [144]:
# DataFrame의 컬럼값 수정
df = pd.DataFrame(np.random.rand(12, 4), index=datas, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2021-03-10  0.298733  0.661144  0.791178  0.189164
2021-03-11  0.264701  0.376459  0.718173  0.248180
2021-03-12  0.941951  0.751747  0.504769  0.840796
2021-03-13  0.023682  0.416878  0.527186  0.498133
2021-03-14  0.880801  0.037246  0.392074  0.904904
2021-03-15  0.218377  0.696292  0.182649  0.182680
2021-03-16  0.257281  0.069976  0.156685  0.701506
2021-03-17  0.938598  0.175150  0.814838  0.739737
2021-03-18  0.534264  0.931929  0.966144  0.903592
2021-03-19  0.452121  0.060477  0.018456  0.066588
2021-03-20  0.346166  0.335013  0.811622  0.884502
2021-03-21  0.514375  0.449576  0.415888  0.792373

In [146]:
# DataFrame이 보유한 values값들만 반환
df.values

array([[0.29873264, 0.66114408, 0.79117789, 0.18916397],
       [0.26470126, 0.37645858, 0.71817291, 0.24817986],
       [0.94195105, 0.75174665, 0.50476862, 0.84079557],
       [0.02368217, 0.41687839, 0.5271858 , 0.49813271],
       [0.88080108, 0.03724577, 0.3920737 , 0.90490363],
       [0.21837676, 0.69629196, 0.18264883, 0.18267988],
       [0.25728094, 0.06997617, 0.15668515, 0.70150613],
       [0.93859811, 0.17514955, 0.81483842, 0.73973677],
       [0.53426411, 0.9319294 , 0.96614428, 0.90359199],
       [0.45212091, 0.06047663, 0.01845641, 0.06658837],
       [0.34616569, 0.33501319, 0.8116215 , 0.88450187],
       [0.51437526, 0.44957581, 0.41588804, 0.79237339]])

In [147]:
df.index

DatetimeIndex(['2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21'],
              dtype='datetime64[ns]', freq='D')

In [148]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [149]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 12 entries, 2021-03-10 to 2021-03-21
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     float64
 1   B       12 non-null     float64
 2   C       12 non-null     float64
 3   D       12 non-null     float64
dtypes: float64(4)
memory usage: 480.0 bytes

In [150]:
# DataFrame의 컬럼값 수정
# ? 12by4 구조로 난수 발생된 정수값들로 DataFrame 생성해 보기 
df = pd.DataFrame(np.random.randint(12, 4), index=datas, columns=['A', 'B', 'C', 'D'])
df

ValueError: low >= high

In [237]:
df1 = pd.DataFrame(np.random.randint(0,48,(12,4)),  index=datas, columns=['A', 'B', 'C', 'D'])
print(type(df1))
print(df1)

<class 'pandas.core.frame.DataFrame'>
             A   B   C   D
2021-03-10   2  43  18  24
2021-03-11   3  18  30  43
2021-03-12  25  31  37  29
2021-03-13  19   7  30  20
2021-03-14  42   7  46   5
2021-03-15  30  45  28   0
2021-03-16  25  30  37   3
2021-03-17   3  28  13   4
2021-03-18  20  23  37  10
2021-03-19  37  33  20  10
2021-03-20  31   1   2  13
2021-03-21  26  26  21  23

In [238]:
# DataFrame의 구조 및 데이터 타입, 결측치 개수까지 확인 가능 
df1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 12 entries, 2021-03-10 to 2021-03-21
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     int32
 1   B       12 non-null     int32
 2   C       12 non-null     int32
 3   D       12 non-null     int32
dtypes: int32(4)
memory usage: 288.0 bytes

In [240]:
# DataFrame의 기초 통계 자료 확인 
df1.describe()

               A          B          C          D
count  12.000000  12.000000  12.000000  12.000000
mean   21.916667  24.333333  26.583333  15.333333
std    13.276489  13.917506  12.302685  12.765959
min     2.000000   1.000000   2.000000   0.000000
25%    15.000000  15.250000  19.500000   4.750000
50%    25.000000  27.000000  29.000000  11.500000
75%    30.250000  31.500000  37.000000  23.250000
max    42.000000  45.000000  46.000000  43.000000

내공 쌓기 : 타입 확인들을 위한 코드들

In [197]:
v = np.random.randint(0,48,(12,4))
print(type(v)) # <class 'numpy.ndarray'>
print(10*'-')
print(v.ndim) # 몇차원인지 확인 가능한 속성
print(v.shape) # (12, 4) 구조

<class 'numpy.ndarray'>
----------
2
(12, 4)

In [211]:
np.random.randint(1, 49)

14

In [244]:
s1 = pd.Series([np.random.randint(1, 49) for i in range(48)])
print(type(s1)) #<class 'pandas.core.series.Series'>
print(s1)

<class 'pandas.core.series.Series'>
0     13
1      5
2      5
3     11
4     28
5     37
6     34
7      7
8     21
9      1
10    28
11    11
12    26
13     4
14    14
15    39
16    26
17    34
18    14
19     6
20    17
21    38
22     1
23    38
24    19
25    37
26    44
27    45
28    22
29    32
30    21
31     3
32    13
33    43
34    43
35    29
36     7
37     2
38    22
39    10
40    47
41    34
42    19
43     6
44    31
45     6
46    41
47    32
dtype: int64

In [250]:
# axis=0 : Series, axis=1 : DataFrame, axis 생략 : Series
df = pd.concat([s1], axis=1) 
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
     0
0   13
1    5
2    5
3   11
4   28
5   37
6   34
7    7
8   21
9    1
10  28
11  11
12  26
13   4
14  14
15  39
16  26
17  34
18  14
19   6
20  17
21  38
22   1
23  38
24  19
25  37
26  44
27  45
28  22
29  32
30  21
31   3
32  13
33  43
34  43
35  29
36   7
37   2
38  22
39  10
40  47
41  34
42  19
43   6
44  31
45   6
46  41
47  32

In [235]:
df = pd.DataFrame(data=np.arange(48).reshape(12, 4), index=datas, columns=['A', 'B', 'C', 'D'])
print(df)

             A   B   C   D
2021-03-10   0   1   2   3
2021-03-11   4   5   6   7
2021-03-12   8   9  10  11
2021-03-13  12  13  14  15
2021-03-14  16  17  18  19
2021-03-15  20  21  22  23
2021-03-16  24  25  26  27
2021-03-17  28  29  30  31
2021-03-18  32  33  34  35
2021-03-19  36  37  38  39
2021-03-20  40  41  42  43
2021-03-21  44  45  46  47

In [236]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 12 entries, 2021-03-10 to 2021-03-21
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     int32
 1   B       12 non-null     int32
 2   C       12 non-null     int32
 3   D       12 non-null     int32
dtypes: int32(4)
memory usage: 288.0 bytes

In [252]:
df1 = pd.DataFrame(np.random.randint(0,48,(12,4)),  index=datas, columns=['A', 'B', 'C', 'D'])
print(type(df1))
print(df1)

<class 'pandas.core.frame.DataFrame'>
             A   B   C   D
2021-03-10  33  45   6  22
2021-03-11  17   2  27  41
2021-03-12  46  18  34  37
2021-03-13  44   5  11  22
2021-03-14  28  39  38  39
2021-03-15  35   6  45  44
2021-03-16  46  37   7   3
2021-03-17  39  36  45  25
2021-03-18  36  40  47  41
2021-03-19   4  43  24  29
2021-03-20  18   6   1  34
2021-03-21   1   9  28  12

In [258]:
# 오름차순ascending=True /내림차순ascending=False
df1.sort_values(by='B', ascending=False)

             A   B   C   D
2021-03-10  33  45   6  22
2021-03-19   4  43  24  29
2021-03-18  36  40  47  41
2021-03-14  28  39  38  39
2021-03-16  46  37   7   3
2021-03-17  39  36  45  25
2021-03-12  46  18  34  37
2021-03-21   1   9  28  12
2021-03-15  35   6  45  44
2021-03-20  18   6   1  34
2021-03-13  44   5  11  22
2021-03-11  17   2  27  41

In [262]:
# 특정 Series만 검색 
print(df1.A)
print(df1['A'])

2021-03-10    33
2021-03-11    17
2021-03-12    46
2021-03-13    44
2021-03-14    28
2021-03-15    35
2021-03-16    46
2021-03-17    39
2021-03-18    36
2021-03-19     4
2021-03-20    18
2021-03-21     1
Freq: D, Name: A, dtype: int32
2021-03-10    33
2021-03-11    17
2021-03-12    46
2021-03-13    44
2021-03-14    28
2021-03-15    35
2021-03-16    46
2021-03-17    39
2021-03-18    36
2021-03-19     4
2021-03-20    18
2021-03-21     1
Freq: D, Name: A, dtype: int32

In [263]:
# 특정 Series들 검색 
df1[ ['A', 'B'] ]

             A   B
2021-03-10  33  45
2021-03-11  17   2
2021-03-12  46  18
2021-03-13  44   5
2021-03-14  28  39
2021-03-15  35   6
2021-03-16  46  37
2021-03-17  39  36
2021-03-18  36  40
2021-03-19   4  43
2021-03-20  18   6
2021-03-21   1   9

In [265]:
# 행을 구분해서 검색
# index명과 : 표기로 범위 선정해서 검색
df1['2021-03-10' : '2021-03-15']

             A   B   C   D
2021-03-10  33  45   6  22
2021-03-11  17   2  27  41
2021-03-12  46  18  34  37
2021-03-13  44   5  11  22
2021-03-14  28  39  38  39
2021-03-15  35   6  45  44

In [267]:
# index값으로 DataFrame slice 
# [시작 : 끝-1]
df1[0:6]

             A   B   C   D
2021-03-10  33  45   6  22
2021-03-11  17   2  27  41
2021-03-12  46  18  34  37
2021-03-13  44   5  11  22
2021-03-14  28  39  38  39
2021-03-15  35   6  45  44

In [268]:
df1

             A   B   C   D
2021-03-10  33  45   6  22
2021-03-11  17   2  27  41
2021-03-12  46  18  34  37
2021-03-13  44   5  11  22
2021-03-14  28  39  38  39
2021-03-15  35   6  45  44
2021-03-16  46  37   7   3
2021-03-17  39  36  45  25
2021-03-18  36  40  47  41
2021-03-19   4  43  24  29
2021-03-20  18   6   1  34
2021-03-21   1   9  28  12

loc 속성

1. 데이터를 slicing 하는 기술
2. loc[index, columns]
3. : 로만 구성하는 표기는 모든 것들 의미

In [271]:
# 모든 row의 A와 B Series 만 slicing
df1.loc[: , ['A', 'B'] ]

             A   B
2021-03-10  33  45
2021-03-11  17   2
2021-03-12  46  18
2021-03-13  44   5
2021-03-14  28  39
2021-03-15  35   6
2021-03-16  46  37
2021-03-17  39  36
2021-03-18  36  40
2021-03-19   4  43
2021-03-20  18   6
2021-03-21   1   9

In [274]:
# index로는 slicing 불가, index명으로 slicing

df1.loc[['2021-03-10', '2021-03-11'] , :]

             A   B   C   D
2021-03-10  33  45   6  22
2021-03-11  17   2  27  41

In [273]:
df1.loc[:, :]

             A   B   C   D
2021-03-10  33  45   6  22
2021-03-11  17   2  27  41
2021-03-12  46  18  34  37
2021-03-13  44   5  11  22
2021-03-14  28  39  38  39
2021-03-15  35   6  45  44
2021-03-16  46  37   7   3
2021-03-17  39  36  45  25
2021-03-18  36  40  47  41
2021-03-19   4  43  24  29
2021-03-20  18   6   1  34
2021-03-21   1   9  28  12

iloc 속성

1. 행과 열의 번호를 이용해서 slicing

In [275]:
# 0번째, 2번째의 row와 conumns 0번째, 2번째 slicing
df1.iloc[ [0, 2] , [0, 2] ]

             A   C
2021-03-10  33   6
2021-03-12  46  34

In [281]:
# 원본의 해당 위치의 데이터값 100 으로 변경 
df1.iloc[0, [0, 2]] = 100
df1

              A   B    C   D
2021-03-10  100  45  100  22
2021-03-11   17   2   27  41
2021-03-12   46  18   34  37
2021-03-13   44   5   11  22
2021-03-14   28  39   38  39
2021-03-15   35   6   45  44
2021-03-16   46  37    7   3
2021-03-17   39  36   45  25
2021-03-18   36  40   47  41
2021-03-19    4  43   24  29
2021-03-20   18   6    1  34
2021-03-21    1   9   28  12

In [282]:
df1

              A   B    C   D
2021-03-10  100  45  100  22
2021-03-11   17   2   27  41
2021-03-12   46  18   34  37
2021-03-13   44   5   11  22
2021-03-14   28  39   38  39
2021-03-15   35   6   45  44
2021-03-16   46  37    7   3
2021-03-17   39  36   45  25
2021-03-18   36  40   47  41
2021-03-19    4  43   24  29
2021-03-20   18   6    1  34
2021-03-21    1   9   28  12

In [283]:
df2 = df1.copy()
df2

              A   B    C   D
2021-03-10  100  45  100  22
2021-03-11   17   2   27  41
2021-03-12   46  18   34  37
2021-03-13   44   5   11  22
2021-03-14   28  39   38  39
2021-03-15   35   6   45  44
2021-03-16   46  37    7   3
2021-03-17   39  36   45  25
2021-03-18   36  40   47  41
2021-03-19    4  43   24  29
2021-03-20   18   6    1  34
2021-03-21    1   9   28  12

In [284]:
df1.iloc[0, 0]

100

In [285]:
df1.iloc[0, 0] = 10
df1

             A   B    C   D
2021-03-10  10  45  100  22
2021-03-11  17   2   27  41
2021-03-12  46  18   34  37
2021-03-13  44   5   11  22
2021-03-14  28  39   38  39
2021-03-15  35   6   45  44
2021-03-16  46  37    7   3
2021-03-17  39  36   45  25
2021-03-18  36  40   47  41
2021-03-19   4  43   24  29
2021-03-20  18   6    1  34
2021-03-21   1   9   28  12

In [286]:
df2

              A   B    C   D
2021-03-10  100  45  100  22
2021-03-11   17   2   27  41
2021-03-12   46  18   34  37
2021-03-13   44   5   11  22
2021-03-14   28  39   38  39
2021-03-15   35   6   45  44
2021-03-16   46  37    7   3
2021-03-17   39  36   45  25
2021-03-18   36  40   47  41
2021-03-19    4  43   24  29
2021-03-20   18   6    1  34
2021-03-21    1   9   28  12

In [287]:
df = pd.DataFrame(np.random.randn(6, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.088350  1.187926  0.933530  1.288407
1  1.345651 -0.056475  0.854170  0.161165
2 -0.340293  0.027177 -0.864381 -0.979194
3 -0.267894 -0.269721  0.895034 -1.003973
4 -0.730389  0.453593  0.935234  0.619724
5 -0.108495  2.236498  0.518850  0.096849

In [289]:
# 새로운 컬럼(series) 추가 및 혹여 이미 존재하는 series였을 경우 데이터 갱신
df['E'] = [11, 2, 3, 4, 5, 6]
df

          A         B         C         D   E
0 -0.088350  1.187926  0.933530  1.288407  11
1  1.345651 -0.056475  0.854170  0.161165   2
2 -0.340293  0.027177 -0.864381 -0.979194   3
3 -0.267894 -0.269721  0.895034 -1.003973   4
4 -0.730389  0.453593  0.935234  0.619724   5
5 -0.108495  2.236498  0.518850  0.096849   6

In [290]:
# 존재하는 series 삭제
del df['E']
df

          A         B         C         D
0 -0.088350  1.187926  0.933530  1.288407
1  1.345651 -0.056475  0.854170  0.161165
2 -0.340293  0.027177 -0.864381 -0.979194
3 -0.267894 -0.269721  0.895034 -1.003973
4 -0.730389  0.453593  0.935234  0.619724
5 -0.108495  2.236498  0.518850  0.096849

In [307]:
# np.nan이 값으로 적용된 series가 DataFrame에 저장시엔 object 타입으로 저장
# 연산 불가, 해결책 타입 지정하면서 저장 또는 저장된 직후 타입 변경

df['E'] = [11, 2, 3, np.nan, 5, 6]
df

          A         B         C         D     E
0  0.061400 -0.339504 -1.023079  0.701672  11.0
1 -0.501888  0.090851  0.082755 -0.786509   2.0
2  1.058604 -1.290121  0.391620  1.701274   3.0
3  0.215302 -0.892067 -1.567043  1.664566   NaN
4  0.368601  0.718000  1.853427 -1.485379   5.0
5 -1.681202 -0.455842  0.282788 -0.019120   6.0

In [292]:
# 해당 seires에 데이터 존재 여부 확인 - isin
df['E'].isin([1, 2])

0    False
1     True
2    False
3    False
4    False
5    False
Name: E, dtype: bool

In [295]:
# 아차!!! 데이터 손실 발생 왜? 기존 DataFrame의 E series의 결측치값만 변경하고 했으나
# = 연산자 잘못 사용해서 E series제외하고 다 손실 
df = df['E'].fillna('4')
df

0    11
1     2
2     3
3     4
4     5
5     6
Name: E, dtype: object

np.nan값이 적용 될 경우 object 타입 따라서 연산 불가 


<a href='https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.astype.html#pandas.DataFrame.astype'>API</a>

In [298]:
# inplace의 속성으로 원본 데이터 수정

df = pd.DataFrame(np.random.randn(6, 4), columns=['A', 'B', 'C', 'D'])
df['E'] = [1, 2, 3, np.nan, 5, 6]
df['E'].fillna('4', inplace=True) # 매우 주요한 속성
df

          A         B         C         D  E
0  0.283548 -0.032984 -1.249883 -0.114919  1
1  0.758215 -1.235329 -0.584822  0.744922  2
2  0.776325  0.852231  0.325984  0.410692  3
3 -0.251775 -1.205444 -0.494264 -0.861481  4
4 -1.179499  0.083382 -0.751453 -0.464349  5
5  0.091591  1.741809  0.872403  0.835794  6

* 늘 고민거리

결측치가 포함된 데이터 series 타입은 숫자가 아닌 타입으로 적용했는지?  <br>
해결책 1 - 결측치 값 대체  <br>
          : 0으로? 평균? 중앙값? 빈도수가 높은 데이터(최빈값)?   <br>
해결책 2 - 타입 변경       <br>
          : 변경 가능한 타입으로 변경

In [302]:
df['E'].min()

TypeError: '<=' not supported between instances of 'float' and 'str'

In [301]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
 4   E       6 non-null      object
dtypes: float64(4), object(1)
memory usage: 368.0+ bytes

In [303]:
df['A'].min()

-1.1794987066167528

In [304]:
# inplace의 속성으로 원본 데이터 수정

df = pd.DataFrame(np.random.randn(6, 4), columns=['A', 'B', 'C', 'D'])
df['E'] = [1, 2, 3, 4, 5, 6]
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
 4   E       6 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 368.0 bytes

In [305]:
df['E'].min()

1

In [308]:
df = pd.DataFrame({'float': [1.0],
                   'int': [1],
                   'datetime': [pd.Timestamp('20180310')],
                   'string': ['foo']})
df.dtypes

float              float64
int                  int64
datetime    datetime64[ns]
string              object
dtype: object

In [309]:
df

   float  int   datetime string
0    1.0    1 2018-03-10    foo

In [327]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
print(df.dtypes)
print(df)

col1    int64
col2    int64
dtype: object
   col1  col2
0     1     3
1     2     4

In [328]:
df = df.astype('float64')
df

   col1  col2
0   1.0   3.0
1   2.0   4.0

In [329]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [330]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    2 non-null      float64
 1   col2    2 non-null      float64
dtypes: float64(2)
memory usage: 160.0 bytes

In [325]:
df = df.astype('float64').dtypes
df

col1    float64
col2    float64
dtype: object

In [322]:
print(type(df))
# df.info()

<class 'pandas.core.series.Series'>

**외부 파일로 DataFrame 생성 및 관리**

In [333]:
df = pd.read_csv("0.dataSet/friends.csv")
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [334]:
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [335]:
# 이름 series만 slicing
df['이름']

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: 이름, dtype: object

In [337]:
# 이영자만 slicing
df.loc[3, '이름']

'이영자'

In [338]:
df.loc[3, '이름'] = '정찬우'
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  정찬우  45  상담사   talk
4  강호동  38  연예인   talk

In [340]:
df = pd.read_csv("0.dataSet/friendsTab.txt")
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
     이름\t나이\t직업\thobby
0  신동엽\t20\t연예인\tmusic
1     유재석\t41\t교수\tart
2   김새롬\t18\t학생\tstudy
3   이영자\t45\t상담사\ttalk
4   강호동\t38\t연예인\ttalk

In [341]:
df = pd.read_csv("0.dataSet/friendsTab.txt", delimiter="\t")
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [343]:
# header 정보가 없는 파일로 DataFrame 생성했을 경우 고려 사항 필수 학습
df = pd.read_csv("0.dataSet/friendsTabNoHead.txt", delimiter="\t")
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [345]:
# 컬럼명(series명) 추가해서 데이터 보존 작업 시도중

# step01 - 헉, 데이터 깔끔하게 날아감!!!
df.columns = ["name", "age", "job", "hobby"]
df

  name  age  job  hobby
0  유재석   41   교수    art
1  김새롬   18   학생  study
2  이영자   45  상담사   talk
3  강호동   38  연예인   talk

In [346]:
# step02 - file 내용 read시에 header 정보 설정 해서 데이터 손실 방지
# header=None 필수 
df = pd.read_csv("0.dataSet/friendsTabNoHead.txt", delimiter="\t", header=None)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [347]:
# 기존 설정을 변경
df.columns = ["name", "age", "job", "hobby"]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [351]:
# file로 read시에 컬럼명 명시하면서 read하는 문법
# 단, header가 없는 파일인 경우에 한해서...

df = pd.read_csv("0.dataSet/friendsTabNoHead.txt", delimiter="\t", 
                 header=None, names= ["name", "age", "job", "hobby"])
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [352]:
# series 추가하면서 모든 row에 동일한 데이터 저장
df['salary'] = 0

In [353]:
df

  name  age  job  hobby  salary
0  신동엽   20  연예인  music       0
1  유재석   41   교수    art       0
2  김새롬   18   학생  study       0
3  이영자   45  상담사   talk       0
4  강호동   38  연예인   talk       0

**삼항 연산자**
1. 조건식?true인경우실행 : false인경우실행
2. numpy 의 where()은 일반 프로그램의 삼항 연산자와 흡사

In [354]:
a = np.arange(10)  # 0~9까지 배열로 생성시키는 함수
print(a)
np.where(a < 5, a, 10*a)

[0 1 2 3 4 5 6 7 8 9]

array([ 0,  1,  2,  3,  4, 50, 60, 70, 80, 90])

In [355]:
df['job']

0    연예인
1     교수
2     학생
3    상담사
4    연예인
Name: job, dtype: object

In [356]:
print(df['job'] != '학생')

0     True
1     True
2    False
3     True
4     True
Name: job, dtype: bool

In [360]:
#? job이 학생인 경우 salary값이 no, 학생이 아닌 경우엔 yes로 where 함수로 적용해 주세요

df['salary'] = np.where(df['job'] != '학생', 'yes', 'no')

In [1]:
df

NameError: name 'df' is not defined

In [4]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'}]
type(friend_dict_list)

list

In [9]:
print(friend_dict_list[0])
print(friend_dict_list[0]['name'])

{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}
신동엽

In [12]:
#List로 DataFrame 객체 생성
df = pd.DataFrame(friend_dict_list)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [13]:
# 컬럼 순서 변경
# 컬럼의 header명을 list로 구성해서 df의 적용
df = df[['hobby', 'age', 'name', 'job']]
df

   hobby  age name  job
0  music   20  신동엽  연예인
1    art   41  유재석   교수
2  study   18  김새롬   학생
3   talk   45  이영자  상담사
4   talk   38  강호동  연예인

# row 자체에 중복 데이터 적용해서 새로운 데이터셋 구성
1. 동일한 row가 존재할 경우 중복 제거
2. age값만 만든 경우 중복이 아닌 경우의 처리

In [21]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'}]
type(friend_dict_list)
df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [17]:
# 중복 여부 확인
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [23]:
# 중복된 마지막 데이터 삭제
df = df.drop_duplicates(keep='last')
df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [50]:
df.loc[3, 'name'] # 값은 확인 가능하지만 수정 불가능

'이영자'

In [51]:
df.iloc[2, 0]

'이영자'

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 1 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   job     5 non-null      object
 3   hobby   5 non-null      object
dtypes: int64(1), object(3)
memory usage: 360.0+ bytes

In [55]:
df.drop_duplicates('name', keep='last', inplace=True)
df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [58]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'}]
type(friend_dict_list)
df = pd.DataFrame(friend_dict_list)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   job     6 non-null      object
 3   hobby   6 non-null      object
dtypes: float64(1), object(3)
memory usage: 320.0+ bytes

In [62]:
df.isna()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [65]:
df.isnull()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [67]:
df['age']

0    20.0
1    41.0
2    18.0
3    45.0
4    38.0
5     NaN
Name: age, dtype: float64

In [80]:
print(df['age'].sum())
print(df['age'].mean())

162.0
32.4

In [82]:
df['age'].fillna(0, inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   0.0  연예인  music

In [85]:
v = df.groupby('job')
print(v)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001EEEB0B68E0>

In [87]:
print(len(v))
print(v.groups)

4
{'교수': [1], '상담사': [3], '연예인': [0, 4, 5], '학생': [2]}

In [89]:
v['age']

In [91]:
df[['job', 'age']]

   job   age
0  연예인  20.0
1   교수  41.0
2   학생  18.0
3  상담사  45.0
4  연예인  38.0
5  연예인   0.0

In [101]:
# job별로 age값의 중앙값 연산 후에 DataFrame의 age값 변환
df.groupby('job')['age'].transform('sum')

0    58.0
1    41.0
2    18.0
3    45.0
4    58.0
5    58.0
Name: age, dtype: float64

In [108]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'},
                     {'name': '고현정', 'age': 44, 'job': '가수', 'hobby':'music'},
                     {'name': '박민영', 'age': 22, 'job': '학생', 'hobby':'art'},
                     {'name': '박서준', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '박보검', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '이효리', 'age' : 28, 'job' : '교수', 'hobby' : 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby':'music'}]
df = pd.DataFrame(friend_dict_list)
df

   name   age  job  hobby
0   신동엽  20.0  연예인  music
1   유재석  41.0   교수    art
2   김새롬  18.0   학생  study
3   이영자  45.0  상담사   talk
4   강호동  38.0  연예인   talk
5   신동엽   NaN  연예인  music
6   고현정  44.0   가수  music
7   박민영  22.0   학생    art
8   박서준  18.0   학생  study
9   박보검  45.0  상담사   talk
10  이효리  28.0   교수   talk
11  이상순  29.0   주부  music

In [111]:
print(df.job)
print(df.job.unique())

0     연예인
1      교수
2      학생
3     상담사
4     연예인
5     연예인
6      가수
7      학생
8      학생
9     상담사
10     교수
11     주부
Name: job, dtype: object
['연예인' '교수' '학생' '상담사' '가수' '주부']

In [113]:
df.job.value_counts()

학생     3
연예인    3
교수     2
상담사    2
가수     1
주부     1
Name: job, dtype: int64

In [115]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]
l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])
print(df1)
print(df2)

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자
  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [117]:
df3 = [df1, df2]
df3

[  name  job
 0  이효리   교수
 1  이상순   학생
 2  박보검  개발자,
   name   job
 0  신동엽  치과의사
 1  이영자    농부
 2  정찬우   연예인]

In [120]:
df4 = pd.concat(df3)
df4

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [122]:
df5 = pd.concat(df3, axis=1)
df5

  name  job name   job
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [123]:
df4 = pd.concat(df3, ignore_index=True)
df4

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인